//Мастям игральных карт присвоены порядковые номера: 1 — пики, 2 — трефы, 3 — бубны, 4 — червы.
//Достоинству карт, старших десятки, присвоены номера: 11 — валет, 12 — дама, 13 — король, 14 — туз.
//Даны два целых числа: N — достоинство (6 ≤ N ≤ 14) и M — масть карты (1 ≤ M ≤ 4).
//Вывести название соответствующей карты вида «шестерка бубен», «дама червей», «туз треф» и т. п.

package HomeWork_2;

public class Task_8 {
    public static void main(String[] args) {

        String a;
        int N, M, m;
        a = "";
        N = 4;
        m = 0;
        M = 14;

        if ( M<=14 & M>=6) {
            m = M;
       } else if (M>=15 | M<=5) {
            System.out.println("Ввели не правильные данные");
            return;
       }

     String [] arr = {"шестерка", "семерка", "восьмерка","девятка","десятка",
             "валет","дама","король","туз"};
     //System.out.println(arr[m]);

        switch (N) {
            case 1:
                a = "пики";
                break;
            case 2:
                a = "треф";
                break;
            case 3 :
                a = "бубен";
                break;
            case 4:
                a = "червей";
                break;
            default:
                System.out.println("Ввели не правильные данные");
                return;
        }
        System.out.println(arr[m-6]+" "+a);
    }
}
